nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f80000evk/common/pin_mux/pin_mux.c
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MC56F80748
package_id: MC56F80748VLH
mcu_data: ksdk2_0
processor_version: 16.3.0
board: MC56F80000-EVK
external_user_signals: {}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_sim.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitOSCPins();
    BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitACCELPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '6', peripheral: GPIOF, signal: 'GPIO, 8', pin_signal: GPIOF8/RXD0/XB_OUT10/PWMA_2X, identifier: WAKE_UP, direction: OUTPUT, gpio_init_state: 'true',
    open_drain: enable, pull_enable: enable}
  - {pin_num: '58', peripheral: GPIOF, signal: 'GPIO, 6', pin_signal: GPIOF6/ANB4f/PWMA_3X/XB_IN2, identifier: INT1_COMBO, direction: OUTPUT, gpio_init_state: 'true',
    pull_enable: disable}
  - {pin_num: '39', peripheral: GPIOF, signal: 'GPIO, 2', pin_signal: GPIOF2/ANA4a/XB_OUT6/LP_SDA0, direction: INPUT, open_drain: enable, pull_enable: enable}
  - {pin_num: '40', peripheral: GPIOF, signal: 'GPIO, 3', pin_signal: GPIOF3/ANB4a/XB_OUT7/LP_SCL0, direction: OUTPUT, gpio_init_state: 'true', open_drain: enable,
    pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitACCELPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitACCELPins(void)
{
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIO functionality on pin GPIOF2 (pin 39) */
    GPIO_PinSetPeripheralMode(BOARD_LP_SDA0_GPIO, BOARD_LP_SDA0_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF3 (pin 40) */
    GPIO_PinSetPeripheralMode(BOARD_LP_SCL0_GPIO, BOARD_LP_SCL0_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF6 (pin 58) */
    GPIO_PinSetPeripheralMode(BOARD_INT1_COMBO_GPIO, BOARD_INT1_COMBO_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF8 (pin 6) */
    GPIO_PinSetPeripheralMode(BOARD_WAKE_UP_GPIO, BOARD_WAKE_UP_PIN_MASK, kGPIO_ModeGpio);

    /* Initialize GPIO functionality on pin GPIOF2 (pin 39)  */
    GPIO_PinSetDirection(BOARD_LP_SDA0_GPIO, BOARD_LP_SDA0_PIN_MASK, kGPIO_DigitalInput);

    /* Pin configuration on GPIOF2 (pin 39) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_LP_SDA0_GPIO, BOARD_LP_SDA0_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Pin configuration on GPIOF3 (pin 40) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_LP_SCL0_GPIO, BOARD_LP_SCL0_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Pin configuration on GPIOF8 (pin 6) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_WAKE_UP_GPIO, BOARD_WAKE_UP_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Initialize GPIO functionality on pin GPIOF3 (pin 40)  */
    GPIO_PinWrite(BOARD_LP_SCL0_GPIO, BOARD_LP_SCL0_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LP_SCL0_GPIO, BOARD_LP_SCL0_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF6 (pin 58)  */
    GPIO_PinWrite(BOARD_INT1_COMBO_GPIO, BOARD_INT1_COMBO_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_INT1_COMBO_GPIO, BOARD_INT1_COMBO_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF8 (pin 6)  */
    GPIO_PinWrite(BOARD_WAKE_UP_GPIO, BOARD_WAKE_UP_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_WAKE_UP_GPIO, BOARD_WAKE_UP_PIN_MASK, kGPIO_DigitalOutput);

    GPIOF->PUR = ((GPIOF->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_MASK)))

                  /* Pull Resistor Enable Bits: 0x010Cu. */
                  | GPIO_PUR_PU(0x010Cu));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitBUTTONsPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '53', peripheral: GPIOE, signal: 'GPIO, 6', pin_signal: GPIOE6/PWMA_3B/XB_IN4/ANB4e/XB_OUT10, direction: INPUT, gpio_interrupt: gpioIrqFallingEdge}
  - {pin_num: '54', peripheral: GPIOE, signal: 'GPIO, 7', pin_signal: GPIOE7/PWMA_3A/XB_IN5/ANA4e/XB_OUT11, direction: INPUT, gpio_interrupt: gpioIrqFallingEdge}
  - {pin_num: '6', peripheral: GPIOF, signal: 'GPIO, 8', pin_signal: GPIOF8/RXD0/XB_OUT10/PWMA_2X, identifier: BUTTON_SW4, direction: INPUT, gpio_interrupt: gpioIrqFallingEdge}
  - {pin_num: '49', peripheral: GPIOC, signal: 'GPIO, 13', pin_signal: GPIOC13/TA3/XB_IN6/EWM_OUT_B, direction: INPUT, gpio_interrupt: gpioIrqFallingEdge}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

