nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f80000evk/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitTHERMISTORPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitTHERMISTORPins(void)
{
    /* GPIOA IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOA);
    /* Enable peripheral functionality on pin GPIOA6 (pin 10) */
    GPIO_PinSetPeripheralMode(BOARD_THER_A_GPIO, BOARD_THER_A_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA7 (pin 9) */
    GPIO_PinSetPeripheralMode(BOARD_THER_B_GPIO, BOARD_THER_B_PIN_MASK, kGPIO_ModePeripheral);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPIPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '31', peripheral: QSPI0, signal: SS, pin_signal: GPIOC6/TA2/XB_IN3/CMP_REF/SS0_B, pull_enable: enable}
  - {pin_num: '32', peripheral: GPIOC, signal: 'GPIO, 7', pin_signal: GPIOC7/SS0_B/TXD0/XB_IN8/XB_OUT6, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '33', peripheral: QSPI0, signal: MISO, pin_signal: GPIOC8/MISO0/RXD0/XB_IN9, pull_enable: enable}
  - {pin_num: '34', peripheral: QSPI0, signal: SCLK, pin_signal: GPIOC9/SCLK0/XB_IN4/TXD0/XB_OUT8, pull_enable: enable}
  - {pin_num: '35', peripheral: QSPI0, signal: MOSI, pin_signal: GPIOC10/MOSI0/XB_IN5/MISO0/XB_OUT9, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSPIPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* Enable peripheral functionality on pin GPIOC6 (pin 31) */
    GPIO_PinSetPeripheralMode(BOARD_ENC_I_GPIO, BOARD_ENC_I_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC6 (pin 31) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C6_SS0_B);
    /* GPIO functionality on pin GPIOC7 (pin 32) */
    GPIO_PinSetPeripheralMode(BOARD_SS0_GPIO, BOARD_SS0_PIN_MASK, kGPIO_ModeGpio);
    /* Enable peripheral functionality on pin GPIOC8 (pin 33) */
    GPIO_PinSetPeripheralMode(BOARD_MISO0_GPIO, BOARD_MISO0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC8 (pin 33) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C8_MISO0);
    /* Enable peripheral functionality on pin GPIOC9 (pin 34) */
    GPIO_PinSetPeripheralMode(BOARD_SCK0_GPIO, BOARD_SCK0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC9 (pin 34) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C9_SCLK0);
    /* Enable peripheral functionality on pin GPIOC10 (pin 35) */
    GPIO_PinSetPeripheralMode(BOARD_MOSI0_GPIO, BOARD_MOSI0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC10 (pin 35) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C10_MOSI0);

    /* Initialize GPIO functionality on pin GPIOC7 (pin 32)  */
    GPIO_PinWrite(BOARD_SS0_GPIO, BOARD_SS0_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_SS0_GPIO, BOARD_SS0_PIN_MASK, kGPIO_DigitalOutput);

    GPIOC->PUR = ((GPIOC->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_MASK)))

                  /* Pull Resistor Enable Bits: 0x0740u. */
                  | GPIO_PUR_PU(0x0740u));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitI2CPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '39', peripheral: LPI2C0, signal: SDA, pin_signal: GPIOF2/ANA4a/XB_OUT6/LP_SDA0, identifier: '', open_drain: enable}
  - {pin_num: '40', peripheral: LPI2C0, signal: SCL, pin_signal: GPIOF3/ANB4a/XB_OUT7/LP_SCL0, identifier: '', open_drain: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI2CPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitI2CPins(void)
{
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* Enable peripheral functionality on pin GPIOF2 (pin 39) */
    GPIO_PinSetPeripheralMode(GPIOF, kGPIO_Pin2, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF2 (pin 39) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F2_LP_SDA0);
    /* Enable peripheral functionality on pin GPIOF3 (pin 40) */
    GPIO_PinSetPeripheralMode(GPIOF, kGPIO_Pin3, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF3 (pin 40) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F3_LP_SCL0);

    /* Pin configuration on GPIOF2 (pin 39) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(GPIOF, kGPIO_Pin2, kGPIO_OutputOpenDrain);

    /* Pin configuration on GPIOF3 (pin 40) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(GPIOF, kGPIO_Pin3, kGPIO_OutputOpenDrain);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
